trunk/fireFoam-1.6-1.0/tutorials/CounterFlowFlame2D/constant/LESProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          LESProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

LESModel       Smagorinsky;
//LESModel       oneEqEddy;

delta           cubeRootVol;

laminarCoeffs
{
}

oneEqEddyCoeffs
{
    ce               1.048;
    ck               0.094;
}

dynOneEqEddyCoeffs
{
    ce               1.05;
    filter          simple;
}

lowReOneEqEddyCoeffs
{
    ck               0.07;
    ce               1.05;
    beta             0.01;
}

SmagorinskyCoeffs
{
    ck               0.0;
    ce               0.202;
//    ck               0.2e-40;
//    ce               0.2e-40;
}

DeardorffDiffStressCoeffs
{
    ce               1.048;
    ck               0.094;
    cm               4.13;
}

cubeRootVolCoeffs
{
    deltaCoeff      1;
}

PrandtlCoeffs
{
    delta           cubeRootVol;
    cubeRootVolCoeffs
    {
        deltaCoeff      1;
    }
    smoothCoeffs
    {
        delta           cubeRootVol;
        cubeRootVolCoeffs
        {
            deltaCoeff      1;
        }
        maxDeltaRatio   1.1;
    }
    Cdelta           0.158;
}

vanDriestCoeffs
{
    delta           cubeRootVol;
    cubeRootVolCoeffs
    {
        deltaCoeff      1;
    }
    smoothCoeffs
    {
        delta           cubeRootVol;
        cubeRootVolCoeffs
        {
            deltaCoeff      1;
        }
        maxDeltaRatio   1.1;
    }
    Aplus            26;
    Cdelta           0.158;
}

smoothCoeffs
{
    delta           cubeRootVol;
    cubeRootVolCoeffs
    {
        deltaCoeff      1;
    }
    maxDeltaRatio   1.1;
}

kappa            0.4187;

wallFunctionCoeffs
{
    E                9;
}


// ************************************************************************* //
