trunk/fireFoam-1.6-1.0/tutorials/CounterFlowFlame2D/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4.1                                 |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

// FoamX Case Dictionary.

FoamFile
{
    version         2.0;
    format          ascii;

    root            "/home/bauwensc/FireStuff";
    case            "Plume";
    instance        "system";
    local           "";

    class           dictionary;
    object          fvSolution;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    rho 
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        0;
        relTol           0;
    };

    pd 
    {
        solver           GAMG;
        tolerance        1e-8;
        relTol           0.0;

        smoother         GaussSeidel;
        nPreSweeps       0;
        nPostSweeps      2;
        nFinestSweeps    2;
        directSolveCoarsest true;

        cacheAgglomeration true;

        nCellsInCoarsestLevel 10;

        agglomerator     faceAreaPair;
        mergeLevels      1;
    };

    pdFinal 
    {
        solver           GAMG;
        tolerance        1e-8;
        relTol           0;

        smoother         GaussSeidel;
        nPreSweeps       0
        nPostSweeps      2;
        nFinestSweeps    2;
        directSolveCoarsest true;

        cacheAgglomeration true;

        nCellsInCoarsestLevel 10;

        agglomerator     faceAreaPair;
        mergeLevels      1;
    };

    ftVar 
    {
        solver           smoothSolver;
        smoother         GaussSeidel;
        tolerance        1e-8;
        relTol           0;
        nSweeps          1;
    };

    U 
    {
        solver           smoothSolver;
        smoother         GaussSeidel;
        tolerance        1e-8;
        relTol           0.0;
        nSweeps          1;
    };

    UFinal 
    {
        solver           smoothSolver;
        smoother         GaussSeidel;
        tolerance        1e-8;
        relTol           0;
        nSweeps          1;
    };

    k 
    {
        solver           smoothSolver;
        smoother         GaussSeidel;
        tolerance        1e-8;
        relTol           0;
        nSweeps          1;
    };

/*
    ft 
    {
        smoother         GaussSeidel;
        tolerance        1e-8;
        relTol           0;
        nSweeps          1;
    };

    h 
    {
        smoother         GaussSeidel;
        tolerance        1e-8;
        relTol           0;
        nSweeps          1;
    };
*/

    ft 
    {
        solver           PBiCG;
        preconditioner   DILU;
        tolerance        1e-8;
        relTol           0;
    };

    h 
    {
        solver           PBiCG;
        preconditioner   DILU;
        tolerance        1e-8;
        relTol           0;
    };

    Ii
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-05;
        relTol          0.01;
    }

}

PISO
{
    momentumPredictor yes;
    nOuterCorrectors  1;
    nCorrectors       2;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}

multiVariate
{
    bMultiVariate    yes;
}

MULES
{
    bMULES     no;
}

compressibleVersion
{
    bLowMach     no;  
}

mixing
{
    ftVarModel       "LESsimilarity"; // "LESsimilarity", "lenghtScale", "transport"
    LESsimilarityC   0.0;
    lengthScaleC     5;
}


betaIntegration
{
    LookUpTable "LookUpTable";
    pdfMethod        0; 
/*
            // 0- delta 
            // 1- lookUpTable
            // 2- recursive
*/
}



relaxationFactors
{
//    U       1.0;
//    h       1.0;
//    k       1.0;
}


// ************************************************************************* //
